ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32WL/STM32Cube_FW/CMSIS/stm32wl5mxx.h
#if defined(CORE_CM0PLUS)
#else
/*!< Peripherals available on CPU1 external PPB bus */
#define DBGMCU_BASE             (0xE0042000UL)
#endif

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */

/* Peripherals available on APB1 bus */
#define TIM2                    ((TIM_TypeDef *) TIM2_BASE)
#define IWDG                    ((IWDG_TypeDef *) IWDG_BASE)
#define WWDG                    ((WWDG_TypeDef *) WWDG_BASE)
#define DAC                     ((DAC_TypeDef *) DAC_BASE)
#define LPTIM1                  ((LPTIM_TypeDef *) LPTIM1_BASE)
#define LPTIM2                  ((LPTIM_TypeDef *) LPTIM2_BASE)
#define LPTIM3                  ((LPTIM_TypeDef *) LPTIM3_BASE)
#define RTC                     ((RTC_TypeDef *) RTC_BASE)
#define SPI2                    ((SPI_TypeDef *) SPI2_BASE)
#define I2C1                    ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                    ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                    ((I2C_TypeDef *) I2C3_BASE)
#define TAMP                    ((TAMP_TypeDef *) TAMP_BASE)
#define USART2                  ((USART_TypeDef *) USART2_BASE)
#define LPUART1                 ((USART_TypeDef *) LPUART1_BASE)

/* Peripherals available on APB2 bus */
#define SYSCFG                  ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define VREFBUF                 ((VREFBUF_TypeDef *) VREFBUF_BASE)
#define COMP1                   ((COMP_TypeDef *) COMP1_BASE)
#define COMP2                   ((COMP_TypeDef *) COMP2_BASE)
#define COMP12_COMMON           ((COMP_Common_TypeDef *) COMP2_BASE)
#define TIM1                    ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                    ((SPI_TypeDef *) SPI1_BASE)
#define ADC                     ((ADC_TypeDef *) ADC_BASE)
#define ADC_COMMON              ((ADC_Common_TypeDef *) ADC_COMMON_BASE)
#define TIM16                   ((TIM_TypeDef *) TIM16_BASE)
#define TIM17                   ((TIM_TypeDef *) TIM17_BASE)
#define USART1                  ((USART_TypeDef *) USART1_BASE)

/* Peripherals available on AHB1 bus */
#define DMA1                    ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1           ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2           ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3           ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4           ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5           ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6           ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7           ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)

#define DMA2                    ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Channel1           ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2           ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3           ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4           ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5           ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#define DMA2_Channel6           ((DMA_Channel_TypeDef *) DMA2_Channel6_BASE)
#define DMA2_Channel7           ((DMA_Channel_TypeDef *) DMA2_Channel7_BASE)

#define DMAMUX1                 ((DMAMUX_Channel_TypeDef *) DMAMUX1_BASE)
#define DMAMUX1_Channel0        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel0_BASE)
#define DMAMUX1_Channel1        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel1_BASE)
#define DMAMUX1_Channel2        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel2_BASE)
#define DMAMUX1_Channel3        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel3_BASE)
#define DMAMUX1_Channel4        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel4_BASE)
#define DMAMUX1_Channel5        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel5_BASE)
#define DMAMUX1_Channel6        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel6_BASE)
#define DMAMUX1_Channel7        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel7_BASE)
#define DMAMUX1_Channel8        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel8_BASE)
#define DMAMUX1_Channel9        ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel9_BASE)
#define DMAMUX1_Channel10       ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel10_BASE)
#define DMAMUX1_Channel11       ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel11_BASE)
#define DMAMUX1_Channel12       ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel12_BASE)
#define DMAMUX1_Channel13       ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel13_BASE)

#define DMAMUX1_RequestGenerator0  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator0_BASE)
#define DMAMUX1_RequestGenerator1  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator1_BASE)
#define DMAMUX1_RequestGenerator2  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator2_BASE)
#define DMAMUX1_RequestGenerator3  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator3_BASE)

#define DMAMUX1_ChannelStatus      ((DMAMUX_ChannelStatus_TypeDef *) DMAMUX1_ChannelStatus_BASE)
#define DMAMUX1_RequestGenStatus   ((DMAMUX_RequestGenStatus_TypeDef *) DMAMUX1_RequestGenStatus_BASE)

#define CRC                     ((CRC_TypeDef *) CRC_BASE)

/* Peripherals available on AHB2 bus */
#define GPIOA                   ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                   ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                   ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOH                   ((GPIO_TypeDef *) GPIOH_BASE)

/* Peripherals available on AH3 bus */
#define AES                     ((AES_TypeDef *) AES_BASE)

#define EXTI                    ((EXTI_TypeDef *) EXTI_BASE)
#define IPCC                    ((IPCC_TypeDef *) IPCC_BASE)
#define IPCC_C1                 ((IPCC_CommonTypeDef *) IPCC_BASE)
#define IPCC_C2                 ((IPCC_CommonTypeDef *) (IPCC_BASE + 0x10U))
#define RCC                     ((RCC_TypeDef *) RCC_BASE)
#define PWR                     ((PWR_TypeDef *) PWR_BASE)
#define RNG                     ((RNG_TypeDef *) RNG_BASE)
#define HSEM                    ((HSEM_TypeDef *) HSEM_BASE)
#if defined(CORE_CM0PLUS)
#define HSEM_COMMON             ((HSEM_Common_TypeDef *) (HSEM_BASE + 0x110U))
#else
#define HSEM_COMMON             ((HSEM_Common_TypeDef *) (HSEM_BASE + 0x100U))
#endif
#define PKA                     ((PKA_TypeDef *) PKA_BASE)
#define FLASH                   ((FLASH_TypeDef *) FLASH_REG_BASE)
#define GTZC_TZSC               ((GTZC_TZSC_TypeDef *) GTZC_TZSC_BASE)
#define GTZC_TZIC               ((GTZC_TZIC_TypeDef *) GTZC_TZIC_BASE)

/* Peripherals available on APB3 bus */
#define SUBGHZSPI               ((SPI_TypeDef *) SUBGHZSPI_BASE)

